---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.DuctLossMethodType
source: html/e97d37df-4991-fa1b-ab8e-deff5b8d0c56.htm
---
# Autodesk.Revit.DB.Mechanical.DuctLossMethodType

An enumerated type listing all duct loss calculation methods for a connector.

## Syntax (C#)
```csharp
public enum DuctLossMethodType
```